# 1~3
# 1. 아래와 같이 오늘의 인사말을 출력하는 함수를 작성하고 호출하세요
# 입력값 예시: 없음
# 출력 예시: "안녕하세요, 오늘도 좋은 하루 되세요!"
def hello():
    print("안녕하세요, 오늘도 좋은 하루 되세요!")

hello()

# 2. 아래와 같이 오늘의 날씨를 입력받아 출력하는 함수를 작성하고 호출하세요
# 입력값 예시: "맑음"
# 출력 예시: "오늘 날씨는 맑음입니다."
def weather(w):
    print(f"오늘 날씨는 {w}입니다.")

weather("맑음")

# 3. 아래와 같이 사용자의 이름을 입력받아 환영 인사를 출력하는 함수를 작성하고 호출하세요
# 입력값 예시: "또치"
# 출력 예시: "또치님, 환영합니다!"
def welcome(name):
    print(name + "님, 환영합니다!")

welcome("또치")   

# 4~5
# 4. 두 개의 숫자를 입력받아, 
# 첫 번째 수에서 두 번째 수를 뺀 결과를 출력하는 함수를 작성하고 호출하세요
# 단, 첫 번째 수가 두 번째 수보다 작으면 "계산할 수 없습니다"를 출력합니다

# 입력값 예시: 20, 10
# 출력 예시: "20 - 10 = 10"

# 입력값 예시: 10, 20
# 출력 예시: "계산할 수 없습니다"

def sub(n1, n2):
    if n1 < n2:
        print("계산할 수 없습니다")
    else:    
        result = n1 - n2
        print(f"{n1} - {n2} ={result}")

sub(20, 10)

# 5. 아래와 같이 숫자를 입력 받아 양수/음수/0을 판별하는 함수를 작성하고 호출하세요
# 입력값 예시: 10
# 출력 예시: "양수입니다"
# 입력값 예시: -5
# 출력 예시: "음수입니다"
# 입력값 예시: 0
# 출력 예시: "0입니다"
def check_num(n):
    if n > 0:
        print("양수입니다")
    elif n < 0:
        print("음수입니다")
    else:
        print("0입니다")

check_num(10)

# 6. 아래와 같이 두 개의 숫자를 입력받아 곱한 값을 반환하는 함수를 작성하고 반환값을 출력하세요
# 입력값 예시: 4, 6
# 반환값 예시: 24
def multiply(a, b):
    return a * b

result = multiply(4, 6)
print(result)

# 7. 아래와 같이 숫자를 입력받아 양수이면 True, 아니면 False를 반환하는 함수를 작성하고 호출하세요
# 입력값 예시: 10
# 반환값 예시: True
# 입력값 예시: -3
# 반환값 예시: False

def is_positive(n):
    if n > 0:
        return True
    else:
        return False

result = is_positive(10)
print(result)
